pok3r-custom/pok3r_re_firmware/vendor/holtek/HT32_STD_1xxxx_FWLib_v003_1679/example/USBD/Mass_Storage_IAP/Src_IAP/iap_usb_scsi_block_command.c
/*********************************************************************************************************//**
 * @file    USBD/Mass_Storage_IAP/Src_IAP/iap_usb_scsi_block_command.c
 * @version $Rev:: 427          $
 * @date    $Date:: 2017-07-04 #$
 * @brief   The SCSI Block Command (SBC-3 & SPC-4).
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32.h"
#include "ht32_usbd_core.h"
#include "iap_usb_bulk_only_transport.h"
#include "iap_usb_scsi_block_command.h"
#include "usb_scsi.h"

/** @addtogroup HT32_Series_Peripheral_Examples HT32 Peripheral Examples
  * @{
  */

/** @addtogroup USBD_Examples USBD
  * @{
  */

/** @addtogroup USBD_Mass_Storage_IAP USBD Mass Storage IAP
  * @{
  */

/** @addtogroup Mass_Storage_IAP IAP
  * @{
  */


/* Private types -------------------------------------------------------------------------------------------*/
typedef void (*pFunction)(BOT_Media_TypeDef *pMedia, u8 *pCB);

typedef enum
{
  SBC_SUCCESS        = 0,
  SBC_CMD_NOTSUPPORT = 2,
  SBC_ERROR          = 3,
} SBC_CBWState_Enum;

typedef struct
{
  u32 uAddress;
  u32 uLength;
  SBC_CBWState_Enum CommandStatus;
} SBCInfo_Typedef;

/* Private constants ---------------------------------------------------------------------------------------*/
#define SBC_CMD_COUNT           (9)

#define _LENGTH_VITAL_PRODUCT                     (sizeof(guSBC_VitalProductData))
#define _LENGTH_INQUIRYDATA                       (sizeof(SBC_InquiryData_TypeDef))
#define _LENGTH_SENSE_DATA                        (sizeof(SBC_SenseData_TypeDef))
#define _LENGTH_READFORMATCAP_DATA                (sizeof(guSBC_ReadFormatCapacityData))
#define _LENGTH_READCAP10_DATA                    (sizeof(guSBC_ReadCapacity10Data))

/* Private function prototypes -----------------------------------------------------------------------------*/
static void _SBC_CMDInquiry(BOT_Media_TypeDef *pMedia, u8 *pCB);
static void _SBC_CMDRequestSense(BOT_Media_TypeDef *pMedia, u8 *pCB);
static void _SBC_CMDTestUnitReady(BOT_Media_TypeDef *pMedia, u8 *pCB);
static void _SBC_CMDRead10(BOT_Media_TypeDef *pMedia, u8 *pCB);
static void _SBC_CMDWrite10(BOT_Media_TypeDef *pMedia, u8 *pCB);
static void _SBC_CMDReadCapacity10(BOT_Media_TypeDef *pMedia, u8 *pCB);
static void _SBC_CMDReadFormatCapacity(BOT_Media_TypeDef *pMedia, u8 *pCB);
static void _SBC_CMDReadModeSense6(BOT_Media_TypeDef *pMedia, u8 *pCB);
static void _SBC_CMDPreventAllowMediumRemoval(BOT_Media_TypeDef *pMedia, u8 *pCB);
static void _SBC_GetAddress(u8 *pCB, u32 uBlockSize);
static u32 _SBC_FindCommand(u8 uCommand);

/* Private macro -------------------------------------------------------------------------------------------*/
#define BE2LE32(bytes)    ((bytes[0] << 24) | (bytes[1] << 16) | (bytes[2] << 8) | (bytes[3] << 0))
#define BE2LE16(bytes)    ((bytes[0] <<  8) | (bytes[1] <<  0))

/* Private variables ---------------------------------------------------------------------------------------*/
static SBCInfo_Typedef gSBCInfo;

static uc8 gSBCCMDTable[SBC_CMD_COUNT] =
{
  SBC_CMD_TEST_UNIT_READY,
  SBC_CMD_READ_10,
  SBC_CMD_WRITE_10,
  SBC_CMD_REQUEST_SENSE,
  SBC_CMD_INQUIRY,
  SBC_CMD_READ_FORMAT_CAPACITIES,
  SBC_CMD_READ_CAPACITY_10,
  SBC_CMD_MODE_SENSE_06,
  SBC_CMD_PREVENT_ALLOW_MEDIUM_REMOVAL,
  //SBC_CMD_ADD_OTHER_COMMAND_HERE,
};

static const pFunction gpFSBCMDHandler[SBC_CMD_COUNT] =
{
  (pFunction)_SBC_CMDTestUnitReady,
  (pFunction)_SBC_CMDRead10,
  (pFunction)_SBC_CMDWrite10,
  (pFunction)_SBC_CMDRequestSense,
  (pFunction)_SBC_CMDInquiry,
  (pFunction)_SBC_CMDReadFormatCapacity,
  (pFunction)_SBC_CMDReadCapacity10,
  (pFunction)_SBC_CMDReadModeSense6,
  (pFunction)_SBC_CMDPreventAllowMediumRemoval,
  //(pFunction)_ADD_OTHER_COMMAND_FUNCTION_HERE,
};

#if (USBDCORE_DEBUG == 1)
static u8 guSBCCMDString[SBC_CMD_COUNT][5] =
{
  "TUR",
  "R10",
  "W10",
  "RSE",
  "INQ",
  "RFC",
  "RC10",
  "MS6",
  "PMR",
  //"_OTHER_COMMAND",
};
#endif

/*----------------------------------------------------------------------------------------------------------*/
/* SBC Related data                                                                                         */
/*----------------------------------------------------------------------------------------------------------*/
__ALIGN4 static uc8 guSBC_VitalProductData[] =
{
  0x00, 0x00, 0x00, 0x00, 0x00
};

__ALIGN4 static u8 guSBC_ReadFormatCapacityData[] =
{
  0x00,
  0x00,
  0x00,
  0x08,                                 /* Capacity List Length                                             */
  0x00, 0x00, 0x00, 0x00,               /* Block Count                                                      */
  0x02,                                 /* Descriptor Code: 0x02 for Formatted Media                        */
  0x00, 0x00, 0x00,                     /* Logical Block Length In Bytes                                    */
};

__ALIGN4 static u8 guSBC_ReadCapacity10Data[] =
{
  0x00, 0x00, 0x00, 0x00,               /* Returned Logical Block Address                                   */
  0x00, 0x00, 0x00, 0x00,               /* Logical Block Length In Bytes                                    */
};

__ALIGN4 static const SBC_InquiryData_TypeDef gSBC_InquiryData[BOT_LUN_NUM] =
{
  {
    SBC_DIRECT_ACCESS_BLOCK_DEVICE,     /*  0 [4:0] Peripheral Device Type                                  */
    SBC_PERIPHERAL_DEVICE_CONNECTED,    /*    [7:5] Peripheral Qualifier                                    */
    SBC_RESERVED_VALUE,                 /*  1 [6:0] Reserved                                                */
    SBC_REMOVEABLE_MEDIUM,              /*    [7:7] Removable Medium (0: Not removable, 1: Removable)       */
    SBC_SPC_VERSION_4,                  /*  2 [7:0] SPC Version                                             */
    0x2,                                /*  3 [3:0] Response data format, only 0x2 is valid                 */
    0,                                  /*    [4:4] Hierarchical addressing (0: Not support, 1: Support)    */
    0,                                  /*    [5:5] Normal ACA Supported (0: Not support, 1: Support)       */
    0,                                  /*    [7:6] Obsolete                                                */
    _LENGTH_INQUIRY_DATAn,              /*  4 [7:0] Additional length (n - 4, which start from 0)           */
    0,                                  /*  5 [0:0] Protection information (0: Not support, 1: Support)     */
    0,                                  /*    [2:1] Reserved                                                */
    0,                                  /*    [3:3] Third-Party Copy supported (0: Not support, 1: Support) */
    SBC_TPGS_NONE,                      /*    [5:4] Target Port Group Support                               */
    0,                                  /*    [6:6] Access Control Coordinator (0: No, 1: Yes)              */
    0,                                  /*    [7:7] SCC Supported (0: Not support, 1: Support)              */
    0,                                  /*  6 [0:0] Unused feature                                          */
    0,                                  /*    [3:1] Obsolete                                                */
    0,                                  /*    [4:4] Multi-Port (0: No, 1: Yes)                              */
    0,                                  /*    [5:5] VS is Not Defined in SPC-4 specification                */
    0,                                  /*    [6:6] Embedded enclosure services component (0: No, 1: Yes)   */
    0,                                  /*    [7:7] Obsolete                                                */
    0,                                  /*  7 [0:0] VS is Not Defined in SPC-4 specification                */
    0,                                  /*    [1:1] Command management model (0: Not support, 1: Support)   */
    0,                                  /*    [3:2] Obsolete                                                */
    0,                                  /*    [5:4] Unused feature                                          */
    0,                                  /*    [7:6] Obsolete                                                */
    {'H','O','L','T','E','K',' ',' '},  /*  8 ~ 15  T10 Vendor identification                               */
    {'M','a','s','s',' ','S','t','o',   /* 16 ~ 31 Product identification                                   */
     'r','a','g','e','1',' ',' ',' '},
    {'0','.','0','1'},                  /* 32 ~ 35 Product Revision Level                                   */
    #if 0
    {'','','','','','','',''            /* 36 ~ 55 Vendor specific data                                     */
     '','','','','','','',''
     '','','',''},
    0,                                  /* 56 [7:0] Unused feature                                          */
    0,                                  /* 57 [7:0] Reserved                                                */
    {SBC_VERSION_DESCRIPTOR_SBC_3},     /* 58 ~ 73  Version Descriptor 1 ~ 8                                */
    {0},                                /* 74 ~ 95   Reserved                                               */
    #endif
  },
};

