pok3r-custom/pok3r_re_firmware/vendor/holtek/HT32_STD_1xxxx_FWLib_v003_1679/example/USBD/Mass_Storage_IAP/Src_IAP/iap_usb_scsi_block_command.c
__ALIGN4 static SBC_SenseData_TypeDef gSBC_SenseData[BOT_LUN_NUM] =
{
  {
    SENSE_DATA_FIXED_CURRENT,           /*  0 [6:0] Response Code                                           */
    0,                                  /*    [7:7] Valid                                                   */
    0,                                  /*  1 [7:0] Obsolete                                                */
    SK_NO_SENSE,                        /*  2 [3:0] Sense Key                                               */
    0,                                  /*    [4:4] ILI                                                     */
    0,                                  /*    [5:5] EOM                                                     */
    0,                                  /*    [6:6] Sense Key                                               */
    0,                                  /*    [7:7] Filemark                                                */
    {0, 0, 0, 0},                       /*  3 ~ 6   Information                                             */
    _LENGTH_SENSE_DATAn,                /*  7 [7:0] Addition Sense Length (0 - 7, which n start from 0)     */
    {0, 0, 0, 0},                       /*  8 ~ 11  Command Specific Information                            */
    0,                                  /* 12 [7:0] Addition Sense Code                                     */
    0,                                  /* 13 [7:0] Addition Sense Qualifier                                */
    0,                                  /* 14 [6:0] Field Replaceable Unit Code                             */
    0,                                  /* 15 [6:0] Response Code                                           */
    0,                                  /*    [7:7] Sense Key Specific Valid                                */
    {0, 0}                              /* 16 ~ 17  Sense Key Specific                                      */
  },
};

/* Global Function -----------------------------------------------------------------------------------------*/
/*********************************************************************************************************//**
  * @brief  SCSI Block Command initialization.
  * @param  pMedia: Target Media
  * @param  uLun: Logic Unit Number
  * @retval None
  ***********************************************************************************************************/
void SBC_Init(BOT_Media_TypeDef *pMedia, u32 uLun)
{
  pMedia->pSBC_InquiryData = (u8 *)(&gSBC_InquiryData[uLun]);
  pMedia->pSBC_SenseData = (u8 *)(&gSBC_SenseData[uLun]);

  return;
}

/*********************************************************************************************************//**
  * @brief  SCSI BLock Command Handler.
  * @param  pMedia: Target Media
  * @param  pCB: Buffer pointer of command block (CB)
  * @retval None
  ***********************************************************************************************************/
void SBC_CMDHandler(BOT_Media_TypeDef *pMedia, u8 *pCB)
{
  #if (USBDCORE_DEBUG == 1)
  u8 uCommand = *pCB;
  #endif
  u32 uCommandIndex;
  gSBCInfo.CommandStatus = SBC_SUCCESS;
  gSBCInfo.uLength = 0;

  uCommandIndex = _SBC_FindCommand(*pCB);
  __DBG_USBPrintf("%06ld [%02x]", __DBG_USBCount, uCommand);

  if (uCommandIndex != SBC_CMD_COUNT && gpFSBCMDHandler[uCommandIndex] != NULL)
  {
    __DBG_USBPrintf("S_%s\r\n", guSBCCMDString[uCommandIndex]);
    (*gpFSBCMDHandler[uCommandIndex])(pMedia, pCB);
  }
  else
  {
    SBC_UpdateSenseData(pMedia, SK_ILLEGAL_REQUEST, ASC_INVALID_COMMAND);
    gSBCInfo.CommandStatus = SBC_CMD_NOTSUPPORT;
  }

  if (gSBCInfo.CommandStatus != SBC_SUCCESS)
  {
    BOT_ErrorHandler(BOT_STALL_BYDIR, BOT_CSW_STATUS_FAILED);
  }

  return;
}

/*********************************************************************************************************//**
  * @brief  SBC Data IN related command.
  * @param  pMedia: Target Media
  * @param  pCB: buffer pointer of command block (CB)
  * @retval None
  ***********************************************************************************************************/
void SBC_DataIN(BOT_Media_TypeDef *pMedia, u8 *pCB)
{
  u32 uCommand = pCB[0];
  switch (uCommand)
  {
    case SBC_CMD_READ_10:
    {
      _SBC_CMDRead10(pMedia, pCB);
      break;
    }
    /*
    case OTHER_SBC_COMMAND:
    {
      break;
    }
    */
    default:
    {
      SBC_UpdateSenseData(pMedia, SK_ILLEGAL_REQUEST, ASC_INVALID_FIELED_IN_COMMAND);
      gSBCInfo.CommandStatus = SBC_CMD_NOTSUPPORT;
      break;
    }
  }

  if (gSBCInfo.CommandStatus != SBC_SUCCESS)
  {
    BOT_ErrorHandler(BOT_STALL_BYDIR, BOT_CSW_STATUS_FAILED);
  }

  return;
}

/*********************************************************************************************************//**
  * @brief  SBC Data OUT related command.
  * @param  pMedia: Target Media
  * @param  pCB: buffer pointer of command block (CB)
  * @retval None
  ***********************************************************************************************************/
void SBC_DataOUT(BOT_Media_TypeDef *pMedia, u8 *pCB)
{
  u32 uCommand = pCB[0];
  switch (uCommand)
  {
    case SBC_CMD_WRITE_10:
    {
      _SBC_CMDWrite10(pMedia, pCB);
      break;
    }
    /*
    case OTHER_SBC_COMMAND:
    {
      break;
    }
    */
    default:
    {
      SBC_UpdateSenseData(pMedia, SK_ILLEGAL_REQUEST, ASC_INVALID_FIELED_IN_COMMAND);
      gSBCInfo.CommandStatus = SBC_CMD_NOTSUPPORT;
      break;
    }
  }

  if (gSBCInfo.CommandStatus != SBC_SUCCESS)
  {
    BOT_ErrorHandler(BOT_STALL_BYDIR, BOT_CSW_STATUS_FAILED);
  }

  return;
}

/*********************************************************************************************************//**
  * @brief  Update sense data for Request Sense SCSI command.
  * @param  pMedia: Target Media to update sense data
  * @param  uSenseKey: Indicates generic information describing an error or exception condition.
  * @param  uAdditionalSenseCode: Indicates further information related to the error or exception
  *         condition reported in the SENSE KEY field.
  * @retval None
  ***********************************************************************************************************/
void SBC_UpdateSenseData(BOT_Media_TypeDef *pMedia, u8 uSenseKey, u8 uAdditionalSenseCode)
{
  SBC_SenseData_TypeDef *pSenseData = (SBC_SenseData_TypeDef *)pMedia->pSBC_SenseData;

