pok3r-custom/pok3r_re_firmware/vendor/holtek/HT32_STD_1xxxx_FWLib_v003_1679/example/USBD/Mass_Storage_IAP/Src_IAP/iap_usb_scsi_block_command.c
  pSenseData->SenseKey = uSenseKey;
  pSenseData->AdditionalSenseCode = uAdditionalSenseCode;

  return;
}

/* Private functions ---------------------------------------------------------------------------------------*/

/*********************************************************************************************************//**
  * @brief  SCSI Block Command (SPC-4) - Inquiry (0x12).
  * @param  pMedia: Target Media
  * @param  pCB: Buffer pointer of command block (CB)
  * @retval None
  ***********************************************************************************************************/
static void _SBC_CMDInquiry(BOT_Media_TypeDef *pMedia, u8 *pCB)
{
  u8 *pBuffer;
  SBC_CMDInquiry_TypeDef *pCMD = (SBC_CMDInquiry_TypeDef *)pCB;
  u32 uLength = BE2LE16(pCMD->AllocationLength);

  if (BOT_CheckCBWParameter(BOT_DIR_IN, uLength) == FALSE)
  {
    return;
  }

  if (pCMD->EVPD == 1)
  {
    pBuffer = (u8 *)guSBC_VitalProductData;
    uLength = _LENGTH_VITAL_PRODUCT;
  }
  else
  {
    pBuffer = (u8 *)(pMedia->pSBC_InquiryData);
    uLength = (uLength <= _LENGTH_INQUIRYDATA) ? uLength : _LENGTH_INQUIRYDATA;
  }

  BOT_WriteINData(pBuffer, uLength, BOT_STATE_DATAIN_LAST);

  return;
}

/*********************************************************************************************************//**
  * @brief  SCSI Block Command (SPC-4) - Request Sense (0x03).
  * @param  pMedia: Target Media
  * @param  pCB: Buffer pointer of command block (CB)
  * @retval None
  ***********************************************************************************************************/
static void _SBC_CMDRequestSense(BOT_Media_TypeDef *pMedia, u8 *pCB)
{
  SBC_CMDRequestSense_TypeDef *pCMD = (SBC_CMDRequestSense_TypeDef *)pCB;
  u32 uLength = BE2LE16(pCMD->AllocationLength);
  if (BOT_CheckCBWParameter(BOT_DIR_IN, uLength) == FALSE)
  {
    return;
  }

  uLength = (uLength <= _LENGTH_SENSE_DATA) ? uLength : _LENGTH_SENSE_DATA;
  BOT_WriteINData((u8 *)(pMedia->pSBC_SenseData), uLength, BOT_STATE_DATAIN_LAST);
  SBC_UpdateSenseData(pMedia, SK_NO_SENSE, 0x0);

  return;
}

/*********************************************************************************************************//**
  * @brief  SCSI Block Command (SPC-4) - Test Unit Ready (0x00).
  * @param  pMedia: Target Media
  * @param  pCB: Buffer pointer of command block (CB)
  * @retval None
  ***********************************************************************************************************/
static void _SBC_CMDTestUnitReady(BOT_Media_TypeDef *pMedia, u8 *pCB)
{
  BOT_CSW_STATUS_Enum status = BOT_CSW_STATUS_PASSED;
  if (BOT_CheckCBWParameter(BOT_DIR_NONE, 0) == FALSE)
  {
    return;
  }

  if (pMedia->GetStatus(pMedia->uId, &(pMedia->Size)) == FALSE)
  {
    SBC_UpdateSenseData(pMedia, SK_NOT_READY, ASC_MEDIUM_NOT_PRESENT);
    status = BOT_CSW_STATUS_FAILED;
  }

  BOT_SendCSW(status);

  return;
}

/*********************************************************************************************************//**
  * @brief  SCSI Block Command (SBC-3) - Read 10 (0x28).
  * @param  pMedia: Target Media
  * @param  pCB: Buffer pointer of command block (CB)
  * @retval None
  ***********************************************************************************************************/
static void _SBC_CMDRead10(BOT_Media_TypeDef *pMedia, u8 *pCB)
{
  u32 uLen;
  u32 uAddr;
  u8 *pBuffer;
  BOT_State_Enum status = BOT_STATE_DATAIN;

  /*--------------------------------------------------------------------------------------------------------*/
  /* When receive SBC Read 10 command, get address from CB and read first block of data. Send the data to   */
  /* USB Buffer for IN transmission. The BOT state machine will call this function again when IN data       */
  /* transmission is finished.                                                                              */
  /*--------------------------------------------------------------------------------------------------------*/
  if (gSBCInfo.uLength == 0)
  {
    _SBC_GetAddress(pCB, pMedia->Size.uBlockSize);
    if (BOT_CheckCBWParameter(BOT_DIR_IN, gSBCInfo.uLength) == FALSE)
    {
      return;
    }
  }

  uAddr = gSBCInfo.uAddress;
  uLen = (gSBCInfo.uLength > BOT_MAX_PACKET_SIZE) ? BOT_MAX_PACKET_SIZE : gSBCInfo.uLength;

  if ((uAddr + uLen) > pMedia->Size.uMemorySize)
  {
    uLen = pMedia->Size.uMemorySize - uAddr;
    status = BOT_STATE_DATAIN_LAST;
    SBC_UpdateSenseData(pMedia, SK_ILLEGAL_REQUEST, ASC_ADDRESS_OUT_OF_RANGE);
    gSBCInfo.CommandStatus = SBC_ERROR;
  }

  /*--------------------------------------------------------------------------------------------------------*/
  /* Set state as BOT_STATE_DATAIN_LAST which cause the BOT state machine send CSW to Host when IN data     */
  /* transmission is finished.                                                                              */
  /*--------------------------------------------------------------------------------------------------------*/
  if ((gSBCInfo.uLength - uLen) == 0)
  {
    status = BOT_STATE_DATAIN_LAST;
  }

  ACC_LED_ON();

  if (pMedia->Read(pMedia->uId, &pBuffer, uAddr, uLen) != FALSE)
  {
    BOT_WriteINData(pBuffer, uLen, status);
    gSBCInfo.uAddress += uLen;
    gSBCInfo.uLength  -= uLen;
  }
  else
  {
    SBC_UpdateSenseData(pMedia, SK_NOT_READY, ASC_UNRECOVERED_READ_ERROR);
    gSBCInfo.CommandStatus = SBC_ERROR;
  }

  ACC_LED_OFF();

  return;
}

/*********************************************************************************************************//**
  * @brief  SCSI Block Command (SBC-3) - Write 10 (0x2A).
  * @param  pMedia: Target Media
  * @param  pCB: Buffer pointer of command block (CB)
  * @retval None
  ***********************************************************************************************************/
static void _SBC_CMDWrite10(BOT_Media_TypeDef *pMedia, u8 *pCB)
{
  u32 uBuffer[64/4];
  u32 uLen;
  u32 uAddr;

  /*--------------------------------------------------------------------------------------------------------*/
  /* When receive SBC Write 10 command, get address from CB and set state as OUT, then the BOT state machine*/
  /* will call this function when next OUT data is received.                                                */
  /*--------------------------------------------------------------------------------------------------------*/
  if (gSBCInfo.uLength == 0)
  {
    _SBC_GetAddress(pCB, pMedia->Size.uBlockSize);
    if (BOT_CheckCBWParameter(BOT_DIR_OUT, gSBCInfo.uLength) == TRUE)
    {
      /*----------------------------------------------------------------------------------------------------*/
      /* Read OUT data with zero length to inform USB Device peripheral that process of CBW OUT             */
      /* data is finished. The USB Device will send ACK to Host when received next OUT data                 */
      /*----------------------------------------------------------------------------------------------------*/
      BOT_ReadOUTData((u8 *)NULL, USB_DISCARD_OUT_DATA);
    }
    return;
  }

