pok3r-custom/pok3r_re_firmware/vendor/holtek/HT32_STD_1xxxx_FWLib_v003_1679/example/USBD/Mass_Storage_IAP/Src_IAP/iap_usb_scsi_block_command.c
  uAddr = gSBCInfo.uAddress;
  uLen = USBDCore_EPTGetTransferCount(BOT_OUT_EPT, USBD_CNTB0);

  if ((uAddr + uLen) > pMedia->Size.uMemorySize)
  {
    SBC_UpdateSenseData(pMedia, SK_ILLEGAL_REQUEST, ASC_ADDRESS_OUT_OF_RANGE);
    gSBCInfo.CommandStatus = SBC_ERROR;
    return;
  }

  BOT_ReadOUTData((u8 *)&uBuffer, uLen);
  if (gSBCInfo.uLength - uLen != 0)
  {
    BOT_ReadOUTData((u8 *)NULL, USB_DISCARD_OUT_DATA);
  }

  ACC_LED_ON();

  if (pMedia->Write(pMedia->uId, (u8 *)&uBuffer, uAddr, uLen) != FALSE)
  {
    gSBCInfo.uLength  -= uLen;
    gSBCInfo.uAddress += uLen;
  }
  else
  {
    SBC_UpdateSenseData(pMedia, SK_NOT_READY, ASC_WRITE_PROTECTED);
    gSBCInfo.CommandStatus = SBC_ERROR;
  }

  ACC_LED_OFF();

  /*--------------------------------------------------------------------------------------------------------*/
  /* Send CSW when all data is received.                                                                    */
  /*--------------------------------------------------------------------------------------------------------*/
  if (gSBCInfo.uLength == 0)
  {
    BOT_SendCSW(BOT_CSW_STATUS_PASSED);
  }

  return;
}

/*********************************************************************************************************//**
  * @brief  SCSI Block Command (SBC-3) - Ready Capacity 10 (0x25).
  * @param  pMedia: Target Media
  * @param  pCB: Buffer pointer of command block (CB)
  * @retval None
  ***********************************************************************************************************/
static void _SBC_CMDReadCapacity10(BOT_Media_TypeDef *pMedia, u8 *pCB)
{
  u32 uLen = _LENGTH_READCAP10_DATA;
  s32 i;

  if (BOT_CheckCBWParameter(BOT_DIR_IN, uLen) == FALSE)
  {
    return;
  }

  for (i = 3; i >= 0; i--)
  {
    guSBC_ReadCapacity10Data[i] = (u8)((pMedia->Size.uBlockCount - 1) >> (24 - i * 8));
    guSBC_ReadCapacity10Data[i + 4] = (u8)(pMedia->Size.uBlockSize >> (24 - i * 8));
  }

  BOT_WriteINData(guSBC_ReadCapacity10Data, uLen, BOT_STATE_DATAIN_LAST);

  return;
}

/*********************************************************************************************************//**
  * @brief  SCSI Block Command (MMC) - Read Format Capacity (0x23).
  * @param  pMedia: Target Media
  * @param  pCB: Buffer pointer of command block (CB)
  * @retval None
  ***********************************************************************************************************/
static void _SBC_CMDReadFormatCapacity(BOT_Media_TypeDef *pMedia, u8 *pCB)
{
  SBC_CMDTypical_TypeDef *pCMD = (SBC_CMDTypical_TypeDef *)pCB;
  u32 uLen = BE2LE16(pCMD->AllocationLength);

  if (BOT_CheckCBWParameter(BOT_DIR_IN, uLen) == FALSE)
  {
    return;
  }

  guSBC_ReadFormatCapacityData[4] = (u8)(pMedia->Size.uBlockCount >> 24);
  guSBC_ReadFormatCapacityData[5] = (u8)(pMedia->Size.uBlockCount >> 16);
  guSBC_ReadFormatCapacityData[6] = (u8)(pMedia->Size.uBlockCount >> 8);
  guSBC_ReadFormatCapacityData[7] = (u8)(pMedia->Size.uBlockCount);

  guSBC_ReadFormatCapacityData[9]  = (u8)(pMedia->Size.uBlockSize >> 16);
  guSBC_ReadFormatCapacityData[10] = (u8)(pMedia->Size.uBlockSize >> 8);
  guSBC_ReadFormatCapacityData[11] = (u8)(pMedia->Size.uBlockSize);

  uLen = (uLen <= _LENGTH_READFORMATCAP_DATA) ? uLen : _LENGTH_READFORMATCAP_DATA;
  BOT_WriteINData(guSBC_ReadFormatCapacityData, uLen, BOT_STATE_DATAIN_LAST);

  return;
}

/*********************************************************************************************************//**
  * @brief  SCSI Block Command (SPC-4) - Read Mode Sense 6 (0x1A).
  * @param  pMedia: Target Media
  * @param  pCB: Buffer pointer of command block (CB)
  * @retval None
  ***********************************************************************************************************/
static void _SBC_CMDReadModeSense6(BOT_Media_TypeDef *pMedia, u8 *pCB)
{
  SBC_CMDModeSecse6_TypeDef *pCMD = (SBC_CMDModeSecse6_TypeDef *)pCB;
  u32 uLen = pCMD->AllocationLength;
  u8 uModeSense6Data[4] = {3, 0, 0, 0};

  if (BOT_CheckCBWParameter(BOT_DIR_IN, uLen) == FALSE)
  {
    return;
  }

  uLen = (uLen <= sizeof(uModeSense6Data)) ? uLen : sizeof(uModeSense6Data);
  BOT_WriteINData(uModeSense6Data, uLen, BOT_STATE_DATAIN_LAST);

  return;
}

/*********************************************************************************************************//**
  * @brief  SCSI Block Command (SBC-3) - Prevent Allow Medium Removal (0x1E).
  * @param  pMedia: Target Media
  * @param  pCB: Buffer pointer of command block (CB)
  * @retval None
  ***********************************************************************************************************/
static void _SBC_CMDPreventAllowMediumRemoval(BOT_Media_TypeDef *pMedia, u8 *pCB)
{
  BOT_SendCSW(BOT_CSW_STATUS_PASSED);
  return;
}

/*********************************************************************************************************//**
  * @brief  Get address information from CB.
  * @param  pCB: Buffer pointer of command block (CB)
  * @param  uBlockSize: Block size of specify media
  * @retval None
  ***********************************************************************************************************/
static void _SBC_GetAddress(u8 *pCB, u32 uBlockSize)
{
  u8 *pLogicalBlockAddress = &pCB[2];
  u8 *pTransferLength;
  u8 uCmd = pCB[0];

  gSBCInfo.uAddress = BE2LE32(pLogicalBlockAddress) * uBlockSize;

  if (uCmd == SBC_CMD_READ_10 || uCmd == SBC_CMD_WRITE_10)
  {
    pTransferLength = &pCB[7];
    gSBCInfo.uLength = BE2LE16(pTransferLength) * uBlockSize;
  }

  #if 0
  switch (*pCB)
  {
    case SBC_CMD_READ_10:
    case SBC_CMD_WRITE_10:
    //case SBC_CMD_VERIFY_10:
    {
      pTransferLength = &pCB[7];
      gSBCInfo.uLength = BE2LE16(pTransferLength) * uBlockSize;
      break;
    }
    #if 0
    case SBC_CMD_READ_12:
    case SBC_CMD_WRITE_12:
    {
      pTransferLength = &pCB[6];
      gSBCInfo.uLength = BE2LE32(pTransferLength) * uBlockSize;
      break;
    }
    #endif
    default:
    {
      break;
    }
  }
  #endif

  return;
}

/*********************************************************************************************************//**
  * @brief  Find SCSI command.
  * @param  uCommand: Command value
  * @retval i: Command index
  ***********************************************************************************************************/
static u32 _SBC_FindCommand(u8 uCommand)
{
  s32 i;

  for (i = SBC_CMD_COUNT - 1; i >= 0; i--)
  {
    if (uCommand == gSBCCMDTable[i])
    {
      return i;
    }
  }

  return SBC_CMD_COUNT;
}


/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
